# convert json to string

In [1]:
import pandas as pd
from io import StringIO as si

# Sample JSON string
data = '''
[
  {"id": 1, "name": "Ankit Roy", "age": 21, "department": "CSE", "cgpa": 8.5},
  {"id": 2, "name": "Sneha Das", "age": 20, "department": "ECE", "cgpa": 9.1},
  {"id": 3, "name": "Rahul Sen", "age": 22, "department": "ME", "cgpa": 7.8},
  {"id": 4, "name": "Priya Sharma", "age": 21, "department": "IT", "cgpa": 8.9}
]
'''
# Convert string to file-like object and read
df = pd.read_json(si(data))
print(df)
print(type(df))

   id          name  age department  cgpa
0   1     Ankit Roy   21        CSE   8.5
1   2     Sneha Das   20        ECE   9.1
2   3     Rahul Sen   22         ME   7.8
3   4  Priya Sharma   21         IT   8.9
<class 'pandas.core.frame.DataFrame'>

# string to json

In [2]:
df.to_json()

'{"id":{"0":1,"1":2,"2":3,"3":4},"name":{"0":"Ankit Roy","1":"Sneha Das","2":"Rahul Sen","3":"Priya Sharma"},"age":{"0":21,"1":20,"2":22,"3":21},"department":{"0":"CSE","1":"ECE","2":"ME","3":"IT"},"cgpa":{"0":8.5,"1":9.1,"2":7.8,"3":8.9}}'

# using orintation

In [3]:
df.to_json(orient='records')

'[{"id":1,"name":"Ankit Roy","age":21,"department":"CSE","cgpa":8.5},{"id":2,"name":"Sneha Das","age":20,"department":"ECE","cgpa":9.1},{"id":3,"name":"Rahul Sen","age":22,"department":"ME","cgpa":7.8},{"id":4,"name":"Priya Sharma","age":21,"department":"IT","cgpa":8.9}]'

In [4]:
# it is defult
df.to_json(orient='index')

'{"0":{"id":1,"name":"Ankit Roy","age":21,"department":"CSE","cgpa":8.5},"1":{"id":2,"name":"Sneha Das","age":20,"department":"ECE","cgpa":9.1},"2":{"id":3,"name":"Rahul Sen","age":22,"department":"ME","cgpa":7.8},"3":{"id":4,"name":"Priya Sharma","age":21,"department":"IT","cgpa":8.9}}'

# read for a link

# read a json using url

In [5]:
import pandas as pd

d = pd.read_json('https://jsonplaceholder.typicode.com/users')
d.head()

,id,name,username,email,address,phone,website,company
0,1,Leanne Graham,Bret,Sincere@april.biz,"{'street': 'Kulas Light', 'suite': 'Apt. 556',...",1-770-736-8031 x56442,hildegard.org,"{'name': 'Romaguera-Crona', 'catchPhrase': 'Mu..."
1,2,Ervin Howell,Antonette,Shanna@melissa.tv,"{'street': 'Victor Plains', 'suite': 'Suite 87...",010-692-6593 x09125,anastasia.net,"{'name': 'Deckow-Crist', 'catchPhrase': 'Proac..."
2,3,Clementine Bauch,Samantha,Nathan@yesenia.net,"{'street': 'Douglas Extension', 'suite': 'Suit...",1-463-123-4447,ramiro.info,"{'name': 'Romaguera-Jacobson', 'catchPhrase': ..."
3,4,Patricia Lebsack,Karianne,Julianne.OConner@kory.org,"{'street': 'Hoeger Mall', 'suite': 'Apt. 692',...",493-170-9623 x156,kale.biz,"{'name': 'Robel-Corkery', 'catchPhrase': 'Mult..."
4,5,Chelsey Dietrich,Kamren,Lucio_Hettinger@annie.ca,"{'street': 'Skiles Walks', 'suite': 'Suite 351...",(254)954-1289,demarco.info,"{'name': 'Keebler LLC', 'catchPhrase': 'User-c..."

# read html file

In [6]:
pip install lxml

Requirement already satisfied: lxml in /Users/apple/AI_ML/venv/lib/python3.12/site-packages (6.0.0)
Note: you may need to restart the kernel to use updated packages.

In [7]:

import pandas as pd
url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"
tables = pd.read_html(url)

# Print the number of tables and show the first one
print(f"Total tables found: {len(tables)}")
tables[0].head()

Total tables found: 1

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545

In [8]:
pip install pandas openpyxl

Requirement already satisfied: pandas in /Users/apple/AI_ML/venv/lib/python3.12/site-packages (2.3.1)
Requirement already satisfied: openpyxl in /Users/apple/AI_ML/venv/lib/python3.12/site-packages (3.1.5)
Requirement already satisfied: numpy>=1.26.0 in /Users/apple/AI_ML/venv/lib/python3.12/site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/apple/AI_ML/venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/apple/AI_ML/venv/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /Users/apple/AI_ML/venv/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: et-xmlfile in /Users/apple/AI_ML/venv/lib/python3.12/site-packages (from openpyxl) (2.0.0)
Requirement already satisfied: six>=1.5 in /Users/apple/AI_ML/venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

# excel file

## make an excel file and read it

In [9]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24, 27, 22],
    'City': ['New York', 'San Francisco', 'Chicago']
}
df1 = pd.DataFrame(data)
df1.to_excel('my_data.xlsx', index=False)
# read it 
df1 = pd.read_excel('my_data.xlsx')
df1

      Name  Age           City
0    Alice   24       New York
1      Bob   27  San Francisco
2  Charlie   22        Chicago

## convert this in a pickle file

In [10]:
df1.to_pickle('df1')

## read this file

In [11]:
pd.read_pickle('df1')

      Name  Age           City
0    Alice   24       New York
1      Bob   27  San Francisco
2  Charlie   22        Chicago

In [12]:
data = [
  {
    "id": 1,
    "name": "Leanne Graham",
    "username": "Bret",
    "email": "Sincere@april.biz"
  },
  {
    "id": 2,
    "name": "Ervin Howell",
    "username": "Antonette",
    "email": "Shanna@melissa.tv"
  }
]
d = pd.DataFrame(data)
d

   id           name   username              email
0   1  Leanne Graham       Bret  Sincere@april.biz
1   2   Ervin Howell  Antonette  Shanna@melissa.tv